app/views/friendships/show.html.erb

SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 1
SELECT `users`.* FROM `users` WHERE (id=friendship.friend_id)
---
<b><div class="users" ><b/>
	<% @friendships = Friendship.where("user_id=id") %>
	<% @friendships.each do |friendship| %>
		<% @users = User.where("id=friendship.friend_id")  %>