app/views/posts/index.html.erb

SELECT `posts`.* FROM `posts` WHERE (user_id = 2)
---
                <% array_of_friend_ids.each do |friend_id| %>
                  <% posts_to_be_displayed = posts_to_be_displayed + Post.find(:all, :conditions => ['user_id = ?', friend_id]) %>