app/controllers/friendships_controller.rb

  def index
    user = User.find(params[:user_id])
    user.friends_count = user.friends_count + 1
    friend = User.find(:first, :conditions => ['id = ?', params[:friend_id]])
    friend.follower_count = friend.follower_count + 1
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    if @friendship.save and user.save and friend.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `friendships` (`created_at`, `friend_id`, `updated_at`, `user_id`) VALUES ('2012-03-02 05:19:39', 2, '2012-03-02 05:19:39', 1)
UPDATE `users` SET `follower_count` = 1, `updated_at` = '2012-03-09 09:32:05' WHERE `users`.`id` = 14

  def show
    @friendships = Friendship.where("user_id = id")
---
SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 1