app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE (NULL in NULL,2,2,3,2,5,7)
---
  def index
    @posts = Post.all(:order => "created_at DESC")

INSERT INTO `posts` (`created_at`, `in_reply_to_post_id`, `in_reply_to_user_id`, `in_reply_to_user_name`, `message`, `source_ip`, `updated_at`, `user_id`) VALUES ('2012-03-09 06:51:06', NULL, NULL, NULL, 'hello', NULL, '2012-03-09 06:51:06', 11)
---
  def create
    @post = Post.create(:message => params[:message], :user_id => current_user.id)