app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `description`, `email`, `first_name`, `follower_count`, `friends_count`, `last_name`, `location`, `password_hash`, `password_salt`, `protected`, `status_count`, `updated_at`, `username`) VALUES ('2012-03-09 06:48:08', 'programmer', 'chirantan.r@gmail.com', 'chirantan', NULL, NULL, 'rajhans', 'berlin', '$2a$10$M8m0DR9pO5UZLq8aDIGHCunf2wsOTIgWFGJZ9.5xFxarhW.SxscfO', '$2a$10$M8m0DR9pO5UZLq8aDIGHCu', NULL, NULL, '2012-03-09 06:48:08', 'chirantan_r')